"""
1.
Дана строка my_str и пустой список my_list.
Заполнить my_list символами из my_str, которые стоят на четных местах в строке

2.
Дана строка my_str, список str_index целых чисел в диапазоне от 0 до длинны строки, пустой список my_list.
Заполнить my_list символами из my_str, которые стоят на местах с индексами из str_index

3.
Даны списки my_list_1 и my_list_2.
Создать список my_result в который поместить элементы из my_list_1 и my_list_2 через один.

4.
Даны списки my_list_1 и my_list_2.
Создать список my_result в который поместить четные элементы из my_list_1 и нечетные элементы из my_list_2.

5.
Дано целое число. Определить сколько цифр в этом числе.

6.
Дано целое число. Определить наибольшую цифру в этом числе.

7.
Дано целое число. Составить число с цифрами в обратном порядке.

8.
Дано целое число. Составить число с цифрами в порядке возрастания.
"""